Tekla Open API Reference for Tekla Structures 2025
BaseComponent.LoadAttributesFromFile Method
 Loads the attributes for the component from the given file. These attributes will be loaded before all the attributes that have been set with the SetAttribute methods, so any attributes that are set with SetAttribute will override those loaded from the given standard file.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool LoadAttributesFromFile(
	string Filename
)
Public Function LoadAttributesFromFile (
	Filename As String
) As Boolean
Parameters
Filename
Type: System.String
The name of the file.
Return Value
Type: Boolean
True if a file name is specified.
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace